In [235]:
import sqlite3 as sql

db_path = "db_practice/practice_db.db"

conn = sql.connect(db_path)
cursor = conn.cursor()

init_query = """
CREATE TABLE TEST_PRIMARY
(
NAME    varchar(255) NOT NULL,
AGE     varchar(255),
GENDER  varchar(255)
)
"""

rm_query = """
DROP TABLE TEST_PRIMARY
"""
cursor.execute(rm_query)
# cursor.execute(init_query)

In [243]:
import pandas as pd
load_qry = """
SELECT * FROM TEST_PRIMARY WHERE GENDER != 'F'
UNION
SELECT * FROM TEST_PRIMARY WHERE GENDER != 'M'
"""

load_qry_basic = """
SELECT * FROM TEST_PRIMARY
"""

test_db = pd.read_sql_query(load_qry_basic, conn)
test_db

    NAME AGE GENDER
0  Young  26      M
1  Patty  19      F
2  Young  26      M
3  Patty  19      F

In [244]:
test_db_man = pd.read_sql_query(load_qry, conn)
test_db_man

    NAME AGE GENDER
0  Patty  19      F
1  Young  26      M

In [198]:
test_result = cursor.execute(load_qry)
#how to call columns
[str(item[0]) for item in test_result.description]

['NAME', 'AGE', 'GENDER']

In [202]:
db_new = pd.DataFrame([["Young", "26", "M"], ["Patty", "19", "F"]], columns = [str(item[0]) for item in test_result.description])
db_new

In [242]:
db_new.to_sql(name = "TEST_PRIMARY", con = conn, if_exists = "append", index = False)